app/controllers/admin/answers_controller.rb

	def create
		@question = Question.find(params[:question_id])
		@answer = @question.answers.create(answer_params)
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
INSERT INTO `answers` (`text`, `question_id`, `created_at`, `updated_at`) VALUES ('Java', 1, '2019-04-15 09:48:48', '2019-04-15 09:48:48')

	def destroy
		@question = Question.find(params[:question_id])
		@answer = @question.answers.find(params[:id])
		@answer.destroy
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT  `answers`.* FROM `answers` WHERE `answers`.`question_id` = 1 AND `answers`.`id` = 4 LIMIT 1
DELETE FROM `answers` WHERE `answers`.`id` = 4