app/controllers/admin/questions_controller.rb

	def index
		@questions = Question.all
---
SELECT `questions`.* FROM `questions`

	def show
		@question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

	def edit
		@question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

	def create
		@question = Question.new(question_params)

		if @question.save
---
INSERT INTO `questions` (`text`, `created_at`, `updated_at`) VALUES ('Which one is not an object oriented programming language?', '2019-04-15 09:41:53', '2019-04-15 09:41:53')