app/views/home/index.html.erb

SELECT `questions`.* FROM `questions`
---
    Quiz.prototype.isEnded = function() {
        return this.questionIndex === this.questions.length;

SELECT `questions`.* FROM `questions`
---
    // create questions
    var questions = [
    	<% @questions.each do |question| %>
        new Question("<%= question.text %>", ["Java", "C#","C++", "C"], "C"),
        <% end %>
    ];