app/views/admin/questions/index.html.erb

              data: { confirm: 'Bạn có chắc không?' } %></td>
    <td><% question.answers.each do |answer| %><%= answer.text %><% end %></td>
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 1