app/controllers/home_controller.rb

SELECT `questions`.* FROM `questions`
---
	def index
		@questions = Question.all